#### FabricationSaveJobOptions Members

---

|  |
| --- |
| FabricationSaveJobOptions Class   Constructors   Methods   Properties   See Also |

The  FabricationSaveJobOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FabricationSaveJobOptions | Default Constructor |
| Public method | FabricationSaveJobOptions(Boolean) | Constructor |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FabricationSaveJobOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AddHolesForTaps | Set true to have holes for taps on straights added to the created fabrication job. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FabricationSaveJobOptions Class

Autodesk.Revit.DB.Fabrication Namespace